string1 = "  hello, worlD   "
print("Функція strip() прибирає пробіли на початку та в кінці рядка:", string1.strip())
print("Функція capitalize() переводить перший символ рядка в верхній регістр:", string1.strip().capitalize()) #для демонстрації пробіли на початку було прибрано
print("Функція title() переводить першу літеру кожного слова в верхній регістр:", string1.title())
print("Функція upper() переводить всі літери рядка в верхній регістр:", string1.upper())
print("Функція lower() переводить всі літери рядка в нижній регістр:", string1.lower())